src/Documents/Scan_УстановкаЦенКомпонентов/Scan_УстановкаЦенКомпонентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_УстановкаЦенКомпонентов</name>
  <registerRecords>InformationRegister.Scan_ЦеныКомпонентовСпецификаций</registerRecords>
  <registerRecords>InformationRegister.Scan_КвотыSOrderFFUПлан</registerRecords>
  <attributes>
    <name>НомерЗапросаВPRS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапросаPRS</name>
    <type>
      <types>EnumRef.Scan_ТипыЗапросовPRS</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросСогласованЗаводами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИзделийВЗапросе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияSOrder</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияЗапросаС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериоддействияЗапросаПо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторЗапроса</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ISOКодСтраны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавод</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СложныйSOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.Scan_Калькуляция</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Scan_ВерсииБазовыхСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоПрайсЛисту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРучныхЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРасчет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииSOrder</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СогласованиеЗаводами</name>
    <attributes>
      <name>Завод</name>
      <type>
        <types>CatalogRef.Scan_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСложногоSOrder</name>
    <attributes>
      <name>КодОснащения</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеАнглийское</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоПрайсЛисту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Замена</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменаРучная</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРучнойЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСпецификации</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ИнформацияПоPartPeriod/Scan_ИнформацияПоPartPeriod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИнформацияПоPartPeriod</name>
  <resources>
    <name>КрайнийСрокРазмещенияЗаказаНаЗавод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>PartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_УстановкаЦенКомпонентов/ManagerModule.bsl
Функция ПолучитьКрайнийСрокРазмещенияЗаказНаЗаводПоПартПериоду(ПартПериод) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПартПериод", ПартПериод);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ИнформацияПоPartPeriod.КрайнийСрокРазмещенияЗаказаНаЗавод КАК КрайнийСрокРазмещенияЗаказаНаЗавод
	               |ИЗ
	               |	РегистрСведений.Scan_ИнформацияПоPartPeriod КАК Scan_ИнформацияПоPartPeriod
	               |ГДЕ
	               |	Scan_ИнформацияПоPartPeriod.PartPeriod = &ПартПериод";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КрайнийСрокРазмещенияЗаказаНаЗавод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
КонецФункции
